Revit 2027 API
StairsPathLineShapeAtCorner Enumeration
 The options for the line shape of a stairs path at a corner.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StairsPathLineShapeAtCorner
Public Enumeration StairsPathLineShapeAtCorner
public enum class StairsPathLineShapeAtCorner
type StairsPathLineShapeAtCorner
Members
Member name | Value | Description
Curved | 1 |  The line shape of stairs path at the corner is curved.
Straight | 0 |  The line shape of stairs path at the corner is straight.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace